tap "felixkratz/formulae"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "spring-io/tap"
brew "xz"
brew "openssl@3"
brew "atuin"
brew "axel"
brew "readline"
brew "bat"
brew "bob"
brew "btop"
brew "exercism"
brew "fastfetch"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "gradle"
brew "imagemagick"
brew "jadx"
brew "jdtls"
brew "jenv"
brew "jq"
brew "kanata"
brew "lazydocker"
brew "lazygit"
brew "lnav"
brew "luajit"
brew "luarocks"
brew "maven"
brew "ncdu"
brew "podman"
brew "poppler"
brew "pyenv"
brew "ripgrep"
brew "httpie"
brew "rust"
brew "sevenzip"
brew "czkawka"
brew "krb5"
brew "spoof-mac"
brew "speedtest-cli"
brew "starship"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "tmuxinator"
brew "wget"
brew "yazi"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "spring-io/tap/spring-boot"
cask "alacritty"
cask "nikitabobko/tap/aerospace"
cask "alt-tab"
cask "cyberduck"
cask "ghostty"
cask "iterm2"
cask "pearcleaner"
cask "podman-desktop"
cask "rectangle"
cask "sublime-text"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "wezterm"
cask "anydesk"
cask "chipmunk"
cask "daisydisk"
cask "zulu@17"
cask "zulu@21"
cask "zulu@8"
cargo "ttyper"
cargo "tuckr"
cargo "zellij"
npm "@google/gemini-cli"
npm "@salesforce/cli"
npm "corepack"
npm "neovim"
npm "pnpm"
npm "yarn"
npm "@salesforce/lwc-language-server"
