tap "danielbayley/alfred"
tap "danvergara/tools"
tap "davidbudnick/tap"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "homebrew/services"
tap "instantclienttap/instantclient"
tap "krtirtho/apps"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "pedh/monaco-nerd-fonts"
tap "slp/krunkit"
tap "spring-io/tap"
brew "xz"
brew "openssl@3"
brew "atuin"
brew "axel"
brew "readline"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bob"
brew "btop"
brew "docker"
brew "docker-compose"
brew "exercism"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "gradle"
brew "grc"
brew "htop"
brew "imagemagick"
brew "ios-deploy"
brew "jadx"
brew "jdtls"
brew "jenv"
brew "jq"
brew "kanata"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lima"
brew "lnav"
brew "luajit"
brew "luarocks"
brew "mas"
brew "maven"
brew "ncdu"
brew "neofetch"
brew "openjdk@11"
brew "openjdk@21"
brew "openssl@1.1"
brew "php"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "showkey"
brew "socat"
brew "speedtest-cli"
brew "starship"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "tmuxinator"
brew "w3m"
brew "wget"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "danvergara/tools/dblab"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "go-task/tap/go-task"
brew "slp/krunkit/krunkit"
brew "spring-io/tap/spring-boot"
cask "nikitabobko/tap/aerospace"
cask "alt-tab"
cask "android-file-transfer"
cask "beekeeper-studio"
cask "blurred"
cask "brave-browser"
cask "copilot-cli"
cask "cyberduck"
cask "devtoys"
cask "diffmerge"
cask "fig"
cask "firefox@developer-edition"
cask "font-0xproto-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "pedh/monaco-nerd-fonts/font-monaco-nerd-font"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "klogg"
cask "meld"
cask "microsoft-teams"
cask "notion"
cask "pearcleaner"
cask "podman-desktop"
cask "postman"
cask "rar"
cask "rectangle"
cask "spotify"
cask "krtirtho/apps/spotube"
cask "sublime-text"
cask "temurin@17"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "wezterm"
cask "zen"
mas "Apple Configurator", id: 1037126344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-preview-github-styles"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "loginspector.loginspector"
vscode "redhat.java"
vscode "salesforce.agent-script-language-client"
vscode "salesforce.apex-language-server-extension"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-einstein-gpt"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-agents"
vscode "salesforce.salesforcedx-vscode-apex"
vscode "salesforce.salesforcedx-vscode-apex-debugger"
vscode "salesforce.salesforcedx-vscode-apex-log"
vscode "salesforce.salesforcedx-vscode-apex-oas"
vscode "salesforce.salesforcedx-vscode-apex-replay-debugger"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-lightning"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-metadata"
vscode "salesforce.salesforcedx-vscode-org"
vscode "salesforce.salesforcedx-vscode-org-browser"
vscode "salesforce.salesforcedx-vscode-services"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "salesforce.sfdx-code-analyzer-vscode"
vscode "tomrijndorp.find-it-faster"
vscode "usernamehw.errorlens"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
cargo "dedoc"
cargo "tredis"
cargo "ttyper"
cargo "tuckr"
cargo "zellij"
npm "@google/gemini-cli"
npm "@salesforce/cli"
npm "cordova"
npm "corepack"
npm "neovim"
npm "pnpm"
npm "vscode-langservers-extracted"
npm "yarn"
